TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3519/driverlib/empty_driverlib_src/ti/driverlib/dl_i2c.h
/**
 *  @brief      Enable SMBus/PMBus Alert response address (ARA) of 000 1100b
 *
 *  When enabled, default alert response address of 0x0001100 is always matched
 *  by the target address match logic
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableAlertResponseAddress(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_EN_ALRESPADR_ENABLE;
}

/**
 *  @brief      Disable SMBus/PMBus default device address of 110 0001b
 *
 *  Used for Address Resolution Protocol. When disabled, the default device
 *  address is not matched.
 *  NOTE: The host address may still be matched if programmed as an own address.
 *    The I2C module can still be addressed as a target if enabled and own
 *  address match is enabled.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableDefaultDeviceAddress(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_EN_DEFDEVADR_MASK);
}

/**
 *  @brief      Checks SMBus/PMBus default device address of 110 0001b is
 *              enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If default device address is enabled
 *
 *  @retval     true   if default device address is enabled
 *  @retval     false  if default device address disabled
 */
__STATIC_INLINE bool DL_I2C_isDefaultDeviceAddressEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SCTR & I2C_SCTR_EN_DEFDEVADR_MASK) ==
            I2C_SCTR_EN_DEFDEVADR_ENABLE);
}

/**
 *  @brief      Enable SMBus/PMBus default device address of 110 0001b
 *
 *  Used for Address Resolution Protocol. When enabled, default device address
 *  of 110 0001b is always matched by the target address match logic.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableDefaultDeviceAddress(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_EN_DEFDEVADR_ENABLE;
}

/**
 *  @brief      Disable target wakeup
 *
 *  When disabled, the target is not allowed to clock stretch on START
 *  detection.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableTargetWakeup(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_SWUEN_MASK);
}

/**
 *  @brief      Checks if target wakeup is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target wakeup is enabled
 *
 *  @retval     true   if target wakeup is enabled
 *  @retval     false  if target wakeup disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetWakeupEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SCTR & I2C_SCTR_SWUEN_MASK) == I2C_SCTR_SWUEN_ENABLE);
}

/**
 *  @brief      Enable target wakeup
 *
 *  Enables low-power wake-up, however it is recommended to enable target clock
 *  stretching to stretch the clock while the module is waking up.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @sa         DL_I2C_enableTargetClockStretching
 */
__STATIC_INLINE void DL_I2C_enableTargetWakeup(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_SWUEN_ENABLE;
}

/**
 *  @brief      Disable target functionality
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableTarget(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_ACTIVE_MASK);
}

/**
 *  @brief      Checks if target functionality is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target functionality is enabled
 *
 *  @retval     true if target functionality is enabled
 *  @retval     false if target functionality is disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetEnabled(I2C_Regs *i2c)
{
    return (
        (i2c->SLAVE.SCTR & I2C_SCTR_ACTIVE_MASK) == I2C_SCTR_ACTIVE_ENABLE);
}

/**
 *  @brief      Enable usage of target functionality
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableTarget(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_ACTIVE_ENABLE;
}

/**
 *  @brief      Disable general call address of 000 0000b
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableGeneralCall(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR &= ~(I2C_SCTR_GENCALL_MASK);
}

/**
 *  @brief      Checks if general call address of 000 0000b is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If general call is enabled
 *
 *  @retval     true if general call is enabled
 *  @retval     false if general call is disabled
 */
__STATIC_INLINE bool DL_I2C_isGeneralCallEnabled(I2C_Regs *i2c)
{
    return (
        (i2c->SLAVE.SCTR & I2C_SCTR_GENCALL_MASK) == I2C_SCTR_GENCALL_ENABLE);
}

/**
 *  @brief      Enable usage of general call address of 000 0000b
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableGeneralCall(I2C_Regs *i2c)
{
    i2c->SLAVE.SCTR |= I2C_SCTR_GENCALL_ENABLE;
}

/**
 *  @brief      Get status of I2C bus controller for target
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Status of I2C bus controller for target
 *
 *  @retval     Bitwise OR of @ref DL_I2C_TARGET_STATUS
 */
__STATIC_INLINE uint32_t DL_I2C_getTargetStatus(I2C_Regs *i2c)
{
    return (i2c->SLAVE.SSR);
}

/**
 *  @brief      Get byte of data from I2C target
 *
 *  If using FIFO, it is first byte from the RX FIFO.
 *
 *  @param[in]  i2c         Pointer to the register overlay for the peripheral
 *
 *  @return     Last received byte of data
 *
 *  @retval     [0x00, 0xff]
 */
__STATIC_INLINE uint8_t DL_I2C_receiveTargetData(I2C_Regs *i2c)
{
    return (uint8_t)(i2c->SLAVE.SRXDATA & I2C_SRXDATA_VALUE_MASK);
}

/**
 *  @brief      Set next byte to be transferred during the next transaction
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  data    Byte of data to be transferred during the next
 *                      transaction. [0x00, 0xff]
 */
__STATIC_INLINE void DL_I2C_transmitTargetData(I2C_Regs *i2c, uint8_t data)
{
    i2c->SLAVE.STXDATA = data;
}

/**
 *  @brief      Disable target ACK override
 *
 *  Disable manual ACK override to automatically ACK all received bytes until
 *  the RX FIFO is full.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableTargetACKOverride(I2C_Regs *i2c)
{
    i2c->SLAVE.SACKCTL &= ~(I2C_SACKCTL_ACKOEN_MASK);
}

/**
 *  @brief      Checks if target ACK override is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target ACK override is enabled
 *
 *  @retval     true if target ACK override is enabled
 *  @retval     false if target ACK override is disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetACKOverrideEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOEN_MASK) ==
            I2C_SACKCTL_ACKOEN_ENABLE);
}

/**
 *  @brief      Enable target ACK override
 *
 *  When manual ACK override is enabled, the I2C target SCL is pulled low after
 *  the last data is received until the ACK override value (through
 *  @ref DL_I2C_setTargetACKOverrideValue) is written.
 *  Disable manual ACK override to automatically ACK all received bytes until
 *  the RX FIFO is full.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_enableTargetACKOverride(I2C_Regs *i2c)
{
    i2c->SLAVE.SACKCTL |= I2C_SACKCTL_ACKOEN_ENABLE;
}

/**
 *  @brief      Get target acknowledge override value
 *
 *  @note for General Call this bit will be ignored if set to NACK and target
 *  continues to receive data.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     What type of response will be generated
 *
 *  @retval     One of @ref DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE.
 */
__STATIC_INLINE DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE
DL_I2C_getTargetACKOverrideValue(I2C_Regs *i2c)
{
    uint32_t value = i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOVAL_MASK;

    return (DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE)(value);
}

/**
 *  @brief      Set target acknowledge override value
 *
 *  @note for General Call this bit will be ignored if set to NACK and target
 *  continues to receive data.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  value   Indicates what type of response will be generated.
 *                      One of @ref DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE.
 *
 *  @sa         DL_I2C_enableTargetACKOverride
 */
__STATIC_INLINE void DL_I2C_setTargetACKOverrideValue(
    I2C_Regs *i2c, DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE value)
{
    DL_Common_updateReg(
        &i2c->SLAVE.SACKCTL, (uint32_t) value, I2C_SACKCTL_ACKOVAL_MASK);
}

/**
 *  @brief      Disable target ACK override on Start Condition
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableACKOverrideOnStart(I2C_Regs *i2c)
{
    i2c->SLAVE.SACKCTL &= ~(I2C_SACKCTL_ACKOEN_ON_START_MASK);
}

/**
 *  @brief      Checks if target ACK override on Start condition is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target ACK override on Start condition is enabled
 *
 *  @retval     true if target ACK override on Start condition is enabled
 *  @retval     false if target ACK override on Start condition is disabled
 */
__STATIC_INLINE bool DL_I2C_isACKOverrideOnStartEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOEN_ON_START_MASK) ==
            I2C_SACKCTL_ACKOEN_ON_START_ENABLE);
}

/**
 *  @brief      Enable target ACK override on Start condition
 *
 *  When enabled, this bit will automatically turn on the Target ACKOEN field
 *  following a Start condition.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @sa                 DL_I2C_enableTargetACKOverride
 */
__STATIC_INLINE void DL_I2C_enableACKOverrideOnStart(I2C_Regs *i2c)
{
    i2c->SLAVE.SACKCTL |= I2C_SACKCTL_ACKOEN_ON_START_ENABLE;
}

/**
 *  @brief      Disable target ACK override when SMBus/PMBus PEC is next byte
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableACKOverrideOnPECNext(I2C_Regs *i2c)
{
    i2c->SLAVE.SACKCTL &= ~(I2C_SACKCTL_ACKOEN_ON_PECNEXT_MASK);
}

/**
 *  @brief      Checks if target ACK override when SMBus/PMBus PEC is next byte
 *              is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target ACK override when PEC is next byte is enabled
 *
 *  @retval     true if target ACK override when PEC is next byte is enabled
 *  @retval     false if target ACK override when PEC is next byte is disabled
 */
__STATIC_INLINE bool DL_I2C_isACKOverrideOnPECNextEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOEN_ON_PECNEXT_MASK) ==
            I2C_SACKCTL_ACKOEN_ON_PECNEXT_ENABLE);
}

/**
 *  @brief      Enable target ACK override when SMBus/PMBus PEC is next byte
 *
 *  When enabled, this bit will automatically turn on the Target ACKOEN field
 *  following the ACK/NACK of the byte received just prior to the PEC byte.
 *  Note that when ACKOEN is set, the PEC byte will not automatically be
 *  ACKed/NACKed by the state machine and FW must perform this function by
 *  writing SLAVE_SACKCTL.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @sa                 DL_I2C_enableTargetACKOverride
 */
__STATIC_INLINE void DL_I2C_enableACKOverrideOnPECNext(I2C_Regs *i2c)
{
    i2c->SLAVE.SACKCTL |= I2C_SACKCTL_ACKOEN_ON_PECNEXT_ENABLE;
}

/**
 *  @brief      Disable target ACK override when SMBus/PMBus PEC is next byte
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableACKOverrideOnPECDone(I2C_Regs *i2c)
{
    i2c->SLAVE.SACKCTL &= ~(I2C_SACKCTL_ACKOEN_ON_PECDONE_MASK);
}

/**
 *  @brief      Checks if target ACK override when SMBus/PMBus PEC is next byte
 *              is enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target ACK override when PEC is next byte is enabled
 *
 *  @retval     true if target ACK override when PEC is next byte is enabled
 *  @retval     false if target ACK override when PEC is next byte is disabled
 */
__STATIC_INLINE bool DL_I2C_isACKOverrideOnPECDoneEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOEN_ON_PECDONE_MASK) ==
            I2C_SACKCTL_ACKOEN_ON_PECDONE_ENABLE);
}

/**
 *  @brief      Enable target ACK override when SMBus/PMBus PEC is done
 *
 *  When enabled, this bit will automatically turn on the Target ACKOEN field
 * following the ACK/NACK of the received PEC byte.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @sa                 DL_I2C_enableTargetACKOverride
 */
__STATIC_INLINE void DL_I2C_enableACKOverrideOnPECDone(I2C_Regs *i2c)
{
    i2c->SLAVE.SACKCTL |= I2C_SACKCTL_ACKOEN_ON_PECDONE_ENABLE;
}

/**
 *  @brief      Get the target SMBus/PMBus Packet Error Checking (PEC) count
 *              value
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     The value the PEC count is set to
 *
 *  @retval     Value between [0x0, 0x01FF]
 */
__STATIC_INLINE uint32_t DL_I2C_getTargetPECCountValue(I2C_Regs *i2c)
{
    return (i2c->SLAVE.TARGET_PECCTL & I2C_TARGET_PECCTL_PECCNT_MASK);
}

/**
 *  @brief      Set the target SMBus/PMBus Packet Error Checking (PEC) count
 *              value
 *
 *  When this field is non zero, the number of I2C data bytes are counted.
 *  Refer to the device TRM for more details.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *  @param[in]  count   The value to set the PEC count to.
 *                      Value between [0x0, 0x01FF]
 */
__STATIC_INLINE void DL_I2C_setTargetPECCountValue(
    I2C_Regs *i2c, uint32_t count)
{
    DL_Common_updateReg(
        &i2c->SLAVE.TARGET_PECCTL, count, I2C_TARGET_PECCTL_PECCNT_MASK);
}

/**
 *  @brief      Disable target SMBus/PMBus Packet Error Checking (PEC)
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2C_disableTargetPEC(I2C_Regs *i2c)
{
    i2c->SLAVE.TARGET_PECCTL &= ~(I2C_TARGET_PECCTL_PECEN_MASK);
}

/**
 *  @brief      Checks if target SMBus/PMBus Packet Error Checking (PEC) is
 *              enabled
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     If target PEC is enabled
 *
 *  @retval     true if target PEC is enabled
 *  @retval     false if target PEC is disabled
 */
__STATIC_INLINE bool DL_I2C_isTargetPECEnabled(I2C_Regs *i2c)
{
    return ((i2c->SLAVE.TARGET_PECCTL & I2C_TARGET_PECCTL_PECEN_MASK) ==
            I2C_TARGET_PECCTL_PECEN_ENABLE);
}

/**
 *  @brief      Enable target SMBus/PMBus Packet Error Checking (PEC)
 *
 *  When enabled, the PEC is calculated on all bits accept the Start, Stop, ACK
 *  and NACK. The PEC LSFR and the Byte Counter is set to 0 when the State
 *  Machine is in the IDLE state, which occurs following a Stop or when a
 *  timeout occurs. The Counter is also set to 0 after the PEC byte is sent or
 *  received. Note that the NACK is automatically sent following a PEC byte
 *  that results in a PEC error.
 *  The PEC Polynomial is x^8 + x^2 + x^1 + 1.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_I2C_enableTargetPEC(I2C_Regs *i2c)
{
    i2c->SLAVE.TARGET_PECCTL |= I2C_TARGET_PECCTL_PECEN_ENABLE;
}

/**
 *  @brief      Get the current SMBus/PMBus PEC byte count of the Target state
 *              machine
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     The current PEC byte count of the target state macione
 *
 *  @retval     Value between [0x0, 0x01FF]
 */
__STATIC_INLINE uint32_t DL_I2C_getTargetCurrentPECCount(I2C_Regs *i2c)
{
    return (i2c->SLAVE.TARGET_PECCTL & I2C_TARGET_PECSR_PECBYTECNT_MASK);
}

/**
 *  @brief      Get status if SMBus/PMBus target PEC was checked in last
 *              transaction
 *
 *  The status indicates if the target PEC was checked in the transaction that
 *  occurred before the last Stop. Latched on Stop.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Status of PEC target checked
 *
 *  @retval     One of @ref DL_I2C_TARGET_PEC_STATUS
 */
__STATIC_INLINE DL_I2C_TARGET_PEC_STATUS DL_I2C_getTargetPECCheckedStatus(
    I2C_Regs *i2c)
{
    uint32_t status =
        i2c->SLAVE.TARGET_PECSR & I2C_TARGET_PECSR_PECSTS_CHECK_MASK;

    return (DL_I2C_TARGET_PEC_STATUS)(status);
}

/**
 *  @brief      Get status if SMBus/PMBus target PEC had an error
 *
 *  The status indicates if a PEC check error occurred in the transaction that
 *  occurred before the last Stop. Latched on Stop.
 *
 *  @param[in]  i2c     Pointer to the register overlay for the peripheral
 *
 *  @return     Status of target PEC error check
 *
 *  @retval     One of @ref DL_I2C_TARGET_PEC_CHECK_ERROR
 */
__STATIC_INLINE DL_I2C_TARGET_PEC_CHECK_ERROR DL_I2C_getTargetPECCheckError(
    I2C_Regs *i2c)
{
    uint32_t status =
        i2c->SLAVE.TARGET_PECSR & I2C_TARGET_PECSR_PECSTS_ERROR_MASK;

